In [1]:
import pandas as pd
import numpy as np

In [2]:
data_1  = np.array([
    ['New York','Mar',12714],
    ['Michigan ','Apr',89238],
    ['Atlanta','Jan',8161],
    ['Boston','Sep',5885],
    ['Birmingham','Mar',10000],
    ['Clanton','Feb',1714],
    ['Marion ','Dec',9238],
    ['Atlantis','Nov',58161],
    ['Alaska','Feb',585],
    ['Arozona','Mar',10000],
    ['Pacfic','Aug',2714],
    ['Ontario ','June',189238],
    ['Toronto','Jan',81651],
    ['Delhi','Oct',58855],
    ['London','Apr',1080],
    ['Texas','Sep',1714],
    ['Washington ','Jul',2038],
    ['Florida','Jan',8161],
    ['Michigan','Oct',58185],
    ['New_Jersy','Apr',10015],
  ])

In [3]:
df2 = pd.DataFrame(data_1, columns=['location','month','sales'])

df2.info()
df2['sales'] = df2['sales'].astype(int)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   location  20 non-null     object
 1   month     20 non-null     object
 2   sales     20 non-null     object
dtypes: object(3)
memory usage: 608.0+ bytes

In [90]:
df2.month.values

array(['Mar', 'Apr', 'Jan', 'Sep', 'Mar', 'Feb', 'Dec', 'Nov', 'Feb',
       'Mar', 'Aug', 'June', 'Jan', 'Oct', 'Apr', 'Sep', 'Jul', 'Jan',
       'Oct', 'Apr'], dtype=object)

In [11]:
df2.head(2) # by default 5 rows initial

    location month  sales
0   New York   Mar  12714
1  Michigan    Apr  89238

In [12]:
df2.tail(2)

     location month  sales
18   Michigan   Oct  58185
19  New_Jersy   Apr  10015

In [20]:
df2.loc[  df2['sales']>10000, 'sales']

0      12714
1      89238
7      58161
11    189238
12     81651
13     58855
18     58185
19     10015
Name: sales, dtype: int32

In [68]:
ind = np.where(df2['sales']>10000)
ind

(array([ 0,  1,  7, 11, 12, 13, 18, 19], dtype=int64),)

In [78]:
df2['new_3'] = df2['sales'].copy()

df2['new_3'].iloc[ind] = 'more'

df2.head(2)

C:\Users\Dralls\anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

    location month  sales new_3   new
0   New York   Mar  12714  more  more
1  Michigan    Apr  89238  more  more

In [5]:
df2['new'] = np.where( df2['sales']>10000, 'more', df2.sales)
df2.head()

     location month  sales    new
0    New York   Mar  12714   more
1   Michigan    Apr  89238   more
2     Atlanta   Jan   8161   8161
3      Boston   Sep   5885   5885
4  Birmingham   Mar  10000  10000

In [22]:
df2.sales[df2['sales']>10000]

0      12714
1      89238
7      58161
11    189238
12     81651
13     58855
18     58185
19     10015
Name: sales, dtype: int32

In [6]:
df2[ df2['sales']>10000 ][['sales','new']]

     sales   new
0    12714  more
1    89238  more
7    58161  more
11  189238  more
12   81651  more
13   58855  more
18   58185  more
19   10015  more

In [89]:
df2[df2['sales']>5000][df2['sales']<10000].head()

C:\Users\Dralls\anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

   location month  sales new_3   new
2   Atlanta   Jan   8161  8161  8161
3    Boston   Sep   5885  5885  5885
6   Marion    Dec   9238  9238  9238
17  Florida   Jan   8161  8161  8161

In [7]:
df2.location.unique()

array(['New York', 'Michigan ', 'Atlanta', 'Boston', 'Birmingham',
       'Clanton', 'Marion ', 'Atlantis', 'Alaska', 'Arozona', 'Pacfic',
       'Ontario ', 'Toronto', 'Delhi', 'London', 'Texas', 'Washington ',
       'Florida', 'Michigan', 'New_Jersy'], dtype=object)

In [12]:
df2.month.duplicated().sum()

9

In [35]:
df2[df2.duplicated()]

Empty DataFrame
Columns: [location, month, sales, new]
Index: []

In [36]:
df2[df2['month'].duplicated()].index

Int64Index([4, 8, 9, 12, 14, 15, 17, 18, 19], dtype='int64')

In [42]:
df2.drop(df2[df2['month'].duplicated()].index) # droping duplicated recored from MOnth column

       location month   sales   new
0      New York   Mar   12714  more
1     Michigan    Apr   89238  more
2       Atlanta   Jan    8161  8161
3        Boston   Sep    5885  5885
5       Clanton   Feb    1714  1714
6       Marion    Dec    9238  9238
7      Atlantis   Nov   58161  more
10       Pacfic   Aug    2714  2714
11     Ontario   June  189238  more
13        Delhi   Oct   58855  more
16  Washington    Jul    2038  2038

In [44]:
df2.drop_duplicates().head() # row wise duplicates removed

     location month  sales    new
0    New York   Mar  12714   more
1   Michigan    Apr  89238   more
2     Atlanta   Jan   8161   8161
3      Boston   Sep   5885   5885
4  Birmingham   Mar  10000  10000

In [41]:
df2['month'].unique()

array(['Mar', 'Apr', 'Jan', 'Sep', 'Feb', 'Dec', 'Nov', 'Aug', 'June',
       'Oct', 'Jul'], dtype=object)

In [115]:
df2[  (df2['sales']>5000) | (df2['month']=='Dec')  & (df2['location'] == 'Marion ')  ]

  location month  sales new_3   new
6  Marion    Dec   9238  9238  9238

In [30]:
display(df2.columns, df2.keys())

Index(['location', 'month', 'sales'], dtype='object')

Index(['location', 'month', 'sales'], dtype='object')

In [4]:
df2.rename(columns = {'location' : 'State',
                     'month' : 'Sales_Month'},inplace = True)

In [51]:
df2['month_new'] = df2['Sales_Month']+' '+df2['new']

In [53]:
df2['updated'] = (df2['sales']/1000)-20

In [64]:
df2.sort_values('updated', inplace = True)

# df2.head()

In [77]:
df2.sort_values(['sales','updated'], ascending = [True,True], ignore_index=True).head()
# df2

         State Sales_Month  sales   new month_new  updated
0       Alaska         Feb    585   585   Feb 585  -19.415
1       London         Apr   1080  1080  Apr 1080  -18.920
2        Texas         Sep   1714  1714  Sep 1714  -18.286
3      Clanton         Feb   1714  1714  Feb 1714  -18.286
4  Washington          Jul   2038  2038  Jul 2038  -17.962

In [69]:
df2.reset_index(drop = True, inplace = True)

          State Sales_Month   sales    new  month_new  updated
0        Alaska         Feb     585    585    Feb 585  -19.415
1        London         Apr    1080   1080   Apr 1080  -18.920
2         Texas         Sep    1714   1714   Sep 1714  -18.286
3       Clanton         Feb    1714   1714   Feb 1714  -18.286
4   Washington          Jul    2038   2038   Jul 2038  -17.962
5        Pacfic         Aug    2714   2714   Aug 2714  -17.286
6        Boston         Sep    5885   5885   Sep 5885  -14.115
7       Florida         Jan    8161   8161   Jan 8161  -11.839
8       Atlanta         Jan    8161   8161   Jan 8161  -11.839
9       Marion          Dec    9238   9238   Dec 9238  -10.762
10      Arozona         Mar   10000  10000  Mar 10000  -10.000
11   Birmingham         Mar   10000  10000  Mar 10000  -10.000
12    New_Jersy         Apr   10015   more   Apr more   -9.985
13     New York         Mar   12714   more   Mar more   -7.286
14     Atlantis         Nov   58161   more   Nov more   38.161
15     Michigan         Oct   58185   more   Oct more   38.185
16        Delhi         Oct   58855   more   Oct more   38.855
17      Toronto         Jan   81651   more   Jan more   61.651
18    Michigan          Apr   89238   more   Apr more   69.238
19     Ontario         June  189238   more  June more  169.238

In [170]:
df2['State'] = df2['State'].apply(lambda x: x.lower())
df2.head()

       State Sales_Month   sales new_3   new  updated
0   ontario         June  189238  more  more  169.238
1  michigan          Apr   89238  more  more   69.238
2    toronto         Jan   81651  more  more   61.651
3      delhi         Oct   58855  more  more   38.855
4   michigan         Oct   58185  more  more   38.185

In [178]:
df2.State.apply(lambda x:'yippee' if 'on' in x else x)

0         yippee
1      michigan
2         yippee
3          delhi
4       michigan
5       atlantis
6       new york
7      new_jersy
9     birmingham
8         yippee
10        yippee
11       florida
12       atlanta
13        yippee
14        pacfic
15        yippee
16         texas
17        yippee
18        yippee
19        alaska
Name: State, dtype: object

In [ ]:
df2.drop('sales',axis=1)

df.drop(['sales','state'],axis=1)

In [39]:
type(df2.State)

pandas.core.series.Series

## String Operation CONTAINS

In [155]:
df2[df2['State'].str.contains('on')]. reset_index(drop = True)

         State Sales_Month  sales  new_3    new  updated
0      Toronto         Jan  81651   more   more   61.651
1      Arozona         Mar  10000  10000  10000  -10.000
2      Marion          Dec   9238   9238   9238  -10.762
3       Boston         Sep   5885   5885   5885  -14.115
4  Washington          Jul   2038   2038   2038  -17.962
5      Clanton         Feb   1714   1714   1714  -18.286
6       London         Apr   1080   1080   1080  -18.920

In [91]:
df2[df2['State'].str.startswith('Ar')]

,State,Sales_Month,sales,new,month_new,updated,month_sales,decoded,decoded_2
9,Arozona,Mar,10000,10000,Mar 10000,-10.0,833.333333,A,A

In [92]:
df2[df2['State'].str.endswith('on')]

,State,Sales_Month,sales,new,month_new,updated,month_sales,decoded,decoded_2
14,London,Apr,1080,1080,Apr 1080,-18.920,90.000000,B,B
5,Clanton,Feb,1714,1714,Feb 1714,-18.286,142.833333,A,A
3,Boston,Sep,5885,5885,Sep 5885,-14.115,490.416667,A,A

In [95]:
df2[df2['State'].str.contains('on')]. set_index('State')

,Sales_Month,sales,new,month_new,updated,month_sales,decoded,decoded_2
State,,,,,,,,
London,Apr,1080,1080,Apr 1080,-18.920,90.000000,B,B
Clanton,Feb,1714,1714,Feb 1714,-18.286,142.833333,A,A
Washington,Jul,2038,2038,Jul 2038,-17.962,169.833333,A,A
Boston,Sep,5885,5885,Sep 5885,-14.115,490.416667,A,A
Marion,Dec,9238,9238,Dec 9238,-10.762,769.833333,A,A
Arozona,Mar,10000,10000,Mar 10000,-10.000,833.333333,A,A
Toronto,Jan,81651,more,Jan more,61.651,6804.250000,A,A

In [112]:
df2['sales_2'] = df2.sales/12


df2.drop(['sales_2','sales'],axis=1).head()   # Removing Column

df2.drop([3,4,5,6]).head()                      # Removing Row

    location month  sales      sales_2
0   New York   Mar  12714  1059.500000
1  Michigan    Apr  89238  7436.500000
2    Atlanta   Jan   8161   680.083333
7   Atlantis   Nov  58161  4846.750000
8     Alaska   Feb    585    48.750000

In [97]:
df2.set_index('State', inplace = True)
df2.head()

,Sales_Month,sales,new,month_new,updated,month_sales,decoded,decoded_2
State,,,,,,,,
Alaska,Feb,585,585,Feb 585,-19.415,48.750000,C,C
London,Apr,1080,1080,Apr 1080,-18.920,90.000000,B,B
Texas,Sep,1714,1714,Sep 1714,-18.286,142.833333,A,A
Clanton,Feb,1714,1714,Feb 1714,-18.286,142.833333,A,A
Washington,Jul,2038,2038,Jul 2038,-17.962,169.833333,A,A

In [99]:
df2.reset_index(inplace = True)

In [100]:
df2.head()

,State,Sales_Month,sales,new,month_new,updated,month_sales,decoded,decoded_2
0,Alaska,Feb,585,585,Feb 585,-19.415,48.750000,C,C
1,London,Apr,1080,1080,Apr 1080,-18.920,90.000000,B,B
2,Texas,Sep,1714,1714,Sep 1714,-18.286,142.833333,A,A
3,Clanton,Feb,1714,1714,Feb 1714,-18.286,142.833333,A,A
4,Washington,Jul,2038,2038,Jul 2038,-17.962,169.833333,A,A

In [61]:
df2[ df2['State'].str.contains('Bir') ]

        State Sales_Month  sales
4  Birmingham         Mar  10000

In [64]:
df2[df2['Sales_Month'].str.contains('ep')].reset_index(drop = True)

    State Sales_Month  sales
0  Boston         Sep   5885
1   Texas         Sep   1714

In [101]:
df2.describe() # Integer

               sales     updated   month_sales
count      20.000000   20.000000     20.000000
mean    30967.350000   10.967350   2580.612500
std     47143.636133   47.143636   3928.636344
min       585.000000  -19.415000     48.750000
25%      2545.000000  -17.455000    212.083333
50%      9619.000000  -10.381000    801.583333
75%     58167.000000   38.167000   4847.250000
max    189238.000000  169.238000  15769.833333

In [110]:
df2.sales.describe()
df2.sales.describe()['mean']

30967.35

In [102]:
df2.describe(include='all')

,State,Sales_Month,sales,new,month_new,updated,month_sales,decoded,decoded_2
count,20,20,20.000000,20,20,20.000000,20.000000,20,20
unique,20,11,NaN,10,16,NaN,NaN,3,3
top,Ontario,Jan,NaN,more,Oct more,NaN,NaN,A,A
freq,1,3,NaN,8,2,NaN,NaN,18,18
mean,NaN,NaN,30967.350000,NaN,NaN,10.967350,2580.612500,NaN,NaN
std,NaN,NaN,47143.636133,NaN,NaN,47.143636,3928.636344,NaN,NaN
min,NaN,NaN,585.000000,NaN,NaN,-19.415000,48.750000,NaN,NaN
25%,NaN,NaN,2545.000000,NaN,NaN,-17.455000,212.083333,NaN,NaN
50%,NaN,NaN,9619.000000,NaN,NaN,-10.381000,801.583333,NaN,NaN
75%,NaN,NaN,58167.000000,NaN,NaN,38.167000,4847.250000,NaN,NaN
max,NaN,NaN,189238.000000,NaN,NaN,169.238000,15769.833333,NaN,NaN

In [103]:
df2.describe(include=['object'])

           State Sales_Month   new month_new decoded decoded_2
count         20          20    20        20      20        20
unique        20          11    10        16       3         3
top     Ontario          Jan  more  Oct more       A         A
freq           1           3     8         2      18        18

In [8]:
df2[(df2['location']=='Alaska') & (df2['month']=='Feb') & (df2['sales']==585)]

  location month  sales
8   Alaska   Feb    585

In [17]:
df2[df2['location'].str.contains('Michigan')][df2['month'].str.contains('Apr')][df2['sales'] == 89238]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

    location month  sales
1  Michigan    Apr  89238

In [ ]:
# new col ----> Location --> Swap case & similar for month column
# new col --> Locatin_month ..... ex - oNATRIO_jAN

In [12]:
df2.head()

     location month  sales
0    New York   Mar  12714
1   Michigan    Apr  89238
2     Atlanta   Jan   8161
3      Boston   Sep   5885
4  Birmingham   Mar  10000

In [15]:
'_'.join(['a','b'])

'a_b'

In [26]:
df2.location +'_'+ df2.month

df2[['location','month']].apply(lambda x: '_'.join(x), axis = 1)

df2[['location','month']].apply(lambda x: '_'.join([x[0],x[1]]) ,axis = 1)
                                                     
df2[['location','month','sales']].apply( lambda x: x[0]+'   '+x[1]+'    '+ str(x[2]), axis = 1 )

0       New York   Mar    12714
1      Michigan    Apr    89238
2         Atlanta   Jan    8161
3          Boston   Sep    5885
4     Birmingham   Mar    10000
5         Clanton   Feb    1714
6         Marion    Dec    9238
7       Atlantis   Nov    58161
8           Alaska   Feb    585
9        Arozona   Mar    10000
10         Pacfic   Aug    2714
11    Ontario    June    189238
12       Toronto   Jan    81651
13         Delhi   Oct    58855
14         London   Apr    1080
15          Texas   Sep    1714
16    Washington    Jul    2038
17        Florida   Jan    8161
18      Michigan   Oct    58185
19     New_Jersy   Apr    10015
dtype: object

In [27]:
df2['loc_2'] = df2.location.apply(lambda x: x.swapcase())

df2['month_2'] = df2.month.apply(lambda x: x.lower())

df2['locn_month_1'] = df2.location +'_'+ df2.month

df2['l_m'] = df2[['location','month']].apply(lambda x: '__'.join(x),axis=1)

df2['new'] = df2[['location','month', 'sales']].apply(lambda x: x[0]+'____' +x[1]+ '__'+ str(x[2]), axis = 1)

# a = 'location'
# b = 'month'
# c = 'sales'

# '_'.join([a,b,c])

# df2.head()

In [28]:
df2['l_m1'] = df2[['location','month']].apply(lambda x: x[0]+'_'+x[1],axis = 1)

In [29]:
df2.head()

,location,month,sales,loc_2,month_2,locn_month_1,l_m,new,l_m1
0,New York,Mar,12714,nEW yORK,mar,New York_Mar,New York__Mar,New York____Mar__12714,New York_Mar
1,Michigan,Apr,89238,mICHIGAN,apr,Michigan _Apr,Michigan __Apr,Michigan ____Apr__89238,Michigan _Apr
2,Atlanta,Jan,8161,aTLANTA,jan,Atlanta_Jan,Atlanta__Jan,Atlanta____Jan__8161,Atlanta_Jan
3,Boston,Sep,5885,bOSTON,sep,Boston_Sep,Boston__Sep,Boston____Sep__5885,Boston_Sep
4,Birmingham,Mar,10000,bIRMINGHAM,mar,Birmingham_Mar,Birmingham__Mar,Birmingham____Mar__10000,Birmingham_Mar

In [131]:
a = ['Michigan','Atlantis','Atlantis','Atlanta']

# O/P ----  ['Michigan','ABC','ABC','Atlanta']

# ['ABC' if 'tis' in i else i for i in a ]

df2['location'].apply(lambda x: 'ON' if 'on' in x else x)

0       New York
1      Michigan
2        Atlanta
3             ON
4     Birmingham
5             ON
6             ON
7       Atlantis
8         Alaska
9             ON
10        Pacfic
11      Ontario
12            ON
13         Delhi
14            ON
15         Texas
16            ON
17       Florida
18      Michigan
19     New_Jersy
Name: location, dtype: object

In [35]:

# Create a new column from your sales column where

# [sales < 5000 ] ------> belongs to category C

# sales value in [5000 - 10000] -------> belongs to category B

# [sales value >100000] -------> belings to category A


df2['sales_categ'] = df2.sales.apply(lambda x: 'A' if x>=10000 else 'B' if 5000<=x<10000 else 'C')
df2.head()

,location,month,sales,loc_2,month_2,locn_month_1,l_m,new,l_m1,sales_categ
0,New York,Mar,12714,nEW yORK,mar,New York_Mar,New York__Mar,New York____Mar__12714,New York_Mar,A
1,Michigan,Apr,89238,mICHIGAN,apr,Michigan _Apr,Michigan __Apr,Michigan ____Apr__89238,Michigan _Apr,A
2,Atlanta,Jan,8161,aTLANTA,jan,Atlanta_Jan,Atlanta__Jan,Atlanta____Jan__8161,Atlanta_Jan,B
3,Boston,Sep,5885,bOSTON,sep,Boston_Sep,Boston__Sep,Boston____Sep__5885,Boston_Sep,B
4,Birmingham,Mar,10000,bIRMINGHAM,mar,Birmingham_Mar,Birmingham__Mar,Birmingham____Mar__10000,Birmingham_Mar,A

In [114]:
df2.columns

Index(['State', 'Sales_Month', 'sales', 'new', 'month_new', 'updated',
       'month_sales', 'decoded', 'decoded_2'],
      dtype='object')

In [112]:
display('UNIQUE',df2.decoded.unique(), 
        'NUNIQUE',df2.decoded.nunique(), 
        df2.decoded.value_counts())

'UNIQUE'

array(['C', 'B', 'A'], dtype=object)

'NUNIQUE'

3

A    18
B     1
C     1
Name: decoded, dtype: int64

In [121]:
df2.Sales_Month.value_counts(normalize =True)*100

Jan     15.0
Mar     15.0
Apr     15.0
Sep     10.0
Feb     10.0
Oct     10.0
Nov      5.0
Aug      5.0
Dec      5.0
June     5.0
Jul      5.0
Name: Sales_Month, dtype: float64

In [122]:
df2.nunique()

State          20
Sales_Month    11
sales          17
new            10
month_new      16
updated        17
month_sales    17
decoded         3
decoded_2       3
dtype: int64

In [78]:
df2.columns

# number of unique categories from each columns

display({i : df2[i].nunique() for i in df2.columns},
        
        [i for i in df2.nunique()])

{'location': 20,
 'month': 11,
 'sales': 17,
 'loc_2': 20,
 'month_2': 11,
 'locn_month_1': 20,
 'l_m': 20,
 'new': 20,
 'l_m1': 20,
 'sales_categ': 3}

[20, 11, 17, 20, 11, 20, 20, 20, 20, 3]

In [74]:
[x for x in df2.columns]

['location',
 'month',
 'sales',
 'loc_2',
 'month_2',
 'locn_month_1',
 'l_m',
 'new',
 'l_m1',
 'sales_categ']

In [47]:
df2.sales_categ.value_counts(normalize = True) # Bring to scale of 100 , 2 decimal places - 50.00, 30.00,20.00

A    0.5
C    0.3
B    0.2
Name: sales_categ, dtype: float64

In [ ]:
df2['sales'].apply(lambda x : 'A' if x >10000 else 'B' if 5000<x<10000 else 'C')

In [137]:
df2 [ (df2.sales>5000) & (df2.sales<10000)]

   location month  sales     sales_2 sales_categ
2   Atlanta   Jan   8161  680.083333           B
3    Boston   Sep   5885  490.416667           B
6   Marion    Dec   9238  769.833333           B
17  Florida   Jan   8161  680.083333           B

In [6]:
df3 = df2.copy()
df3.set_index('State', inplace = True)
df3

            Sales_Month   sales
State
New York            Mar   12714
Michigan            Apr   89238
Atlanta             Jan    8161
Boston              Sep    5885
Birmingham          Mar   10000
Clanton             Feb    1714
Marion              Dec    9238
Atlantis            Nov   58161
Alaska              Feb     585
Arozona             Mar   10000
Pacfic              Aug    2714
Ontario            June  189238
Toronto             Jan   81651
Delhi               Oct   58855
London              Apr    1080
Texas               Sep    1714
Washington          Jul    2038
Florida             Jan    8161
Michigan            Oct   58185
New_Jersy           Apr   10015

In [11]:
df3.loc['Delhi']

Sales_Month      Oct
sales          58855
Name: Delhi, dtype: object

In [23]:
df2.head()

In [19]:
df2.loc[0,'Sales_Month']

'Mar'

In [21]:
df3.loc[['Alaska','Clanton','Washington ']

In [22]:
df3.loc[:,['sales','Sales_Month']]

In [140]:
df3.loc[['Alaska','Clanton','Washington '],'Sales_Month']

State
Alaska         Feb
Clanton        Feb
Washington     Jul
Name: Sales_Month, dtype: object

In [143]:
df3.loc['Washington ','month_new']='new value'
df3.loc['Washington ','month_new']

'new value'

In [98]:
df2.loc[0:6] # by default rows only

df2.loc[6, 'month']
        
df2.locn_month_1.loc[0:6]
df2.head()

,location,month,sales,loc_2,month_2,locn_month_1,l_m1,l_m,month1,new
0,New York,Mar,12714,nEW yORK,mar,New York_Mar,New York_Mar,New York__Mar,mAR,New York____Mar__12714
1,Michigan,Apr,89238,mICHIGAN,apr,Michigan _Apr,Michigan _Apr,Michigan __Apr,aPR,Michigan ____Apr__89238
2,Atlanta,Jan,8161,aTLANTA,jan,Atlanta_Jan,Atlanta_Jan,Atlanta__Jan,jAN,Atlanta____Jan__8161
3,Boston,Sep,5885,bOSTON,sep,Boston_Sep,Boston_Sep,Boston__Sep,sEP,Boston____Sep__5885
4,Birmingham,Mar,10000,bIRMINGHAM,mar,Birmingham_Mar,Birmingham_Mar,Birmingham__Mar,mAR,Birmingham____Mar__10000

In [50]:
df3 = df2.set_index('location')

In [97]:
df3.loc['Atlanta', 'sales'] # accept names be it row name or columns name

# wont accept the index values

df3.sales.loc[[ 'Birmingham','New York', 'Ontario ', 'Delhi'] ]  # only given list of Index names thus will consider all columns

df3.loc[[ 'Birmingham','New York', 'Ontario ', 'Delhi'], ['sales', 'loc_2','month_2'] ] # .loc[ [row names] , [column names] ] 

df3.loc[['Birmingham','New York', 'Ontario ', 'Delhi']] # by default -- rows taken with all columns in o/p

8161

In [118]:
df[['location', 'month']].apply(lambda x: [x[0],x[1]], axis = 1)

0        [New York, Mar]
1       [Michigan , Apr]
2         [Atlanta, Jan]
3          [Boston, Sep]
4      [Birmingham, Mar]
5         [Clanton, Feb]
6         [Marion , Dec]
7        [Atlantis, Nov]
8          [Alaska, Feb]
9         [Arozona, Mar]
10         [Pacfic, Aug]
11      [Ontario , June]
12        [Toronto, Jan]
13          [Delhi, Oct]
14         [London, Apr]
15          [Texas, Sep]
16    [Washington , Jul]
17        [Florida, Jan]
18       [Michigan, Oct]
19      [New_Jersy, Apr]
dtype: object

In [5]:
df2.head()

     location month  sales
0    New York   Mar  12714
1   Michigan    Apr  89238
2     Atlanta   Jan   8161
3      Boston   Sep   5885
4  Birmingham   Mar  10000

In [6]:
df2.loc[4,'sales']

df2.sales.loc[4]

10000

In [18]:
df2[['sales','month']].loc[4]

df2.loc[4,['sales','month']]

df2.loc[   [4,3,10] ,   ['sales','month']    ]

df2.loc[ 2:9 , 'month']

df2.loc[ 2:9 , ['month','location']]

df2.loc[ 2:9 , 'sales':'l_m1' ].head()

df3.loc['Michigan ':'Boston' , 'l_m1']

df3.loc[:, 'month'].head()

sales    10000
month      Mar
Name: 4, dtype: object

In [100]:
df2.head()

     location month  sales
0    New York   Mar  12714
1   Michigan    Apr  89238
2     Atlanta   Jan   8161
3      Boston   Sep   5885
4  Birmingham   Mar  10000

In [78]:
df2.head()

        State Sales_Month  sales
0    New York         Mar  12714
1   Michigan          Apr  89238
2     Atlanta         Jan   8161
3      Boston         Sep   5885
4  Birmingham         Mar  10000

In [81]:
df2.iloc[[0,3,4],0:1]

        State
0    New York
3      Boston
4  Birmingham

In [155]:
# Loc - upperbound INcluded

# ILOC - same as regular python

df2.iloc[0:7 ,  3:5]

df3.iloc[3, :]

df3.iloc[3:9 , 0:2]

df2.iloc[2:9, 0:1]

df2.iloc[[2,6,8,9],[0,4,2]]

         State
2        Texas
3      Clanton
4  Washington
5       Pacfic
6       Boston
7      Florida
8      Atlanta

In [66]:
df2.Sales_Month.unique()

df2.Sales_Month.nunique()

df2.Sales_Month.duplicated().sum()

df2.duplicated().sum() # 

df2[df2.Sales_Month.duplicated()]

0

In [70]:
df2.Sales_Month.value_counts(normalize = True)

Apr     0.15
Mar     0.15
Jan     0.15
Feb     0.10
Oct     0.10
Sep     0.10
June    0.05
Jul     0.05
Aug     0.05
Nov     0.05
Dec     0.05
Name: Sales_Month, dtype: float64

In [133]:
df2.sales.sum()

df2.sales.std()

df2.sales.median()

df2.sales.min()

619347

In [123]:
df2.location.unique()

df2.month.unique()

df2.sales.unique()

array(['New York', 'Michigan ', 'Atlanta', 'Boston', 'Birmingham',
       'Clanton', 'Marion ', 'Atlantis', 'Alaska', 'Arozona', 'Pacfic',
       'Ontario ', 'Toronto', 'Delhi', 'London', 'Texas', 'Washington ',
       'Florida', 'Michigan', 'New_Jersy'], dtype=object)

In [145]:
[df2[i].unique() for i in df2.columns]

[array(['New York', 'Michigan ', 'Atlanta', 'Boston', 'Birmingham',
        'Clanton', 'Marion ', 'Atlantis', 'Alaska', 'Arozona', 'Pacfic',
        'Ontario ', 'Toronto', 'Delhi', 'London', 'Texas', 'Washington ',
        'Florida', 'Michigan', 'New_Jersy'], dtype=object),
 array(['Mar', 'Apr', 'Jan', 'Sep', 'Feb', 'Dec', 'Nov', 'Aug', 'June',
        'Oct', 'Jul'], dtype=object),
 array([ 12714,  89238,   8161,   5885,  10000,   1714,   9238,  58161,
           585,   2714, 189238,  81651,  58855,   1080,   2038,  58185,
         10015])]

In [124]:
df2.location.nunique()

20

In [161]:
[ df2[i].nunique() for i in df2.columns]

[20, 11, 17]

In [165]:
df2.iloc[:,:]

Index(['location', 'month', 'sales'], dtype='object')

In [166]:
for i in df2:
    print(i)

location
month
sales